m3xD/auto_parking/esp32/main.cpp
#include "secrets.h" // File chứa thông tin bí mật (WiFi, AWS credentials, certificates)
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <ESP32Servo.h>
#include <time.h>
#include <esp_task_wdt.h>  // Watchdog Timer
#include <Preferences.h>   // Lưu trữ không bay hơi

// ======= ĐỊNH NGHĨA PIN CHO CẢM BIẾN VÀ SERVO ========
// Cảm biến cổng
#define SENSOR_VAO_1_PIN 13
#define SENSOR_VAO_2_PIN 26
#define SENSOR_RA_1_PIN  34
#define SENSOR_RA_2_PIN  35

// Servo điều khiển rào chắn
#define SERVO_ENTRY_PIN 18
#define SERVO_EXIT_PIN  19

// Cảm biến chỗ đỗ (4 cảm biến IR)
#define SLOT_SENSOR_PIN_1 23
#define SLOT_SENSOR_PIN_2 4
#define SLOT_SENSOR_PIN_3 16

// ======= HẰNG SỐ VÀ CẤU HÌNH ========
// Cấu hình Watchdog
#define WDT_TIMEOUT 10  // 10 giây timeout cho watchdog

// Cấu hình đo lường thời gian và debounce
#define GATE_SENSOR_DEBOUNCE_INTERVAL 500   // ms
#define SLOT_DEBOUNCE_DELAY 1000            // ms
#define STATUS_REPORT_INTERVAL 60000        // 1 phút
#define STATE_SAVE_INTERVAL 300000          // 5 phút
#define RECONNECT_INTERVAL 5000             // 5 giây
#define MAX_RECONNECT_ATTEMPTS 5            // Số lần thử kết nối tối đa
#define ACTIVITY_TIMEOUT 1800000            // 30 phút trước khi chuyển sang chế độ tiết kiệm năng lượng

// Cấu hình MQTT
#define MAX_MQTT_QUEUE 10                   // Số lượng thông điệp MQTT tối đa trong hàng đợi
#define MAX_MQTT_PAYLOAD_SIZE 512           // Kích thước tối đa của payload MQTT

// Cấu hình NTP
#define NTP_SERVER "pool.ntp.org"
#define GMT_OFFSET_SEC 7 * 3600             // UTC+7 
#define DAYLIGHT_OFFSET_SEC 0

// ======= KHAI BÁO ĐỐI TƯỢNG TOÀN CỤC ========
// Khởi tạo đối tượng Servo
Servo servoEntry, servoExit;

// Khởi tạo đối tượng WiFi, MQTT và lưu trữ
WiFiClientSecure net = WiFiClientSecure();
PubSubClient client(net);
Preferences preferences;

// ======= CÁC CẤU TRÚC DỮ LIỆU ========
// Cấu trúc quản lý cảm biến cổng
struct GateSensor {
  const int pin;
  const char* sensorIdentifier;
  const char* gateAreaMqttId;
  const char* eventTypeOnActive;
  bool isActive;
  bool prevIsActive;
  unsigned long lastDebounceTime;
  const int activeLogicLevel;     // Mức logic được coi là active (HIGH hoặc LOW)
  bool autoCloseBarrier;
  Servo* associatedServo;
  int servoClosePosition;
  const char* barrierTypeForState;
};

// Cấu trúc quản lý cảm biến chỗ đỗ
struct ParkingSlotSensor {
  const int pin;
  const char* slotMqttId;
  bool isOccupied;
  bool prevIsOccupied;
  unsigned long lastDebounceTime;
  const int activeLogicLevel;
};

// Cấu trúc cho hàng đợi MQTT
struct MQTTMessage {
  char topic[50];
  char payload[MAX_MQTT_PAYLOAD_SIZE];
  size_t length;
  bool retained;
  int qos;
  bool pending;
};

// ======= KHỞI TẠO CẢM BIẾN ========
// Cảm biến cổng với activeLogicLevel phù hợp
GateSensor gateSensors[] = {
  // {pin, identifier, gateArea, eventType, isActive, prevIsActive, lastDebounce, activeLogic, autoClose, servo, servoPos, barrierType}
  {SENSOR_VAO_1_PIN, "SENSOR_VAO_1", "entry_approach", "presence_detected", false, false, 0, LOW, false, NULL, 0, ""},
  {SENSOR_VAO_2_PIN, "SENSOR_VAO_2", "entry_passed",   "vehicle_passed",    false, false, 0, LOW, true, &servoEntry, 90, "entry"},
  {SENSOR_RA_1_PIN,  "SENSOR_RA_1",  "exit_approach",  "presence_detected", false, false, 0, LOW, false, NULL, 0, ""},
  {SENSOR_RA_2_PIN,  "SENSOR_RA_2",  "exit_passed",    "vehicle_passed",    false, false, 0, HIGH,  true, &servoExit, 90, "exit"}
};
const int NUM_GATE_SENSORS = sizeof(gateSensors) / sizeof(GateSensor);

// Cảm biến chỗ đỗ
ParkingSlotSensor parkingSlots[] = {
  // {pin, slotId, isOccupied, prevIsOccupied, lastDebounce, activeLogic}
  {SLOT_SENSOR_PIN_1, "S1", false, false, 0, LOW},
  {SLOT_SENSOR_PIN_2, "S2", false, false, 0, LOW},
  {SLOT_SENSOR_PIN_3, "S3", false, false, 0, LOW},
  //{SLOT_SENSOR_PIN_4, "S4", false, false, 0, LOW}
};
const int NUM_PARKING_SLOTS = sizeof(parkingSlots) / sizeof(ParkingSlotSensor);

// ======= BIẾN TOÀN CỤC ========
// Biến cho hàng đợi MQTT
MQTTMessage mqttQueue[MAX_MQTT_QUEUE];
int mqttQueueIndex = 0;

// Biến cho quản lý kết nối
unsigned long lastReconnectAttempt = 0;
int reconnectCount = 0;
String deviceMacAddress = "";

// Biến cho quản lý năng lượng
unsigned long lastActivityTime = 0;
bool lowPowerMode = false;

// Biến cho báo cáo trạng thái
unsigned long lastStatusReport = 0;
unsigned long lastStateSave = 0;
String firmwareVersion = "1.0.0";  // Phiên bản firmware

// Biến toàn cục theo dõi trạng thái
int totalOccupiedSlots = 0;
bool entryGateOpen = false;
bool exitGateOpen = false;
unsigned long systemStartTime = 0;

// ======= KHAI BÁO HÀM ========
// Các hàm kết nối và giao tiếp
void connectWiFi();
void syncNTPTime();
boolean reconnectAWSIoT();
void connectAWSIoT();
String getTimeStamp();

// Các hàm xử lý MQTT
void messageHandler(char* topic, byte* payload, unsigned int length);
bool queueMqttMessage(const char* topic, const char* payload, size_t length, int qos = 0, bool retained = false);
bool publishMqttMessage(const char* topic, const JsonDocument& doc, int qos = 0, bool retained = false);
void processQueuedMessages();

// Các hàm xuất bản trạng thái
void publishBarrierState(const char* barrierType, const char* state);
void publishGateSensorEvent(const char* sensorPinIdentifier, const char* gateArea, const char* eventType);
void publishParkingSlotStatus(const char* slotMqttId, bool isOccupied);
void publishInitialState();
void reportSystemStatus();

// Các hàm xử lý cảm biến
void handleGateSensors();
void handleParkingSlotSensors();

// Các hàm lưu trữ trạng thái
void saveState();
void restoreState();

// ======= TRIỂN KHAI CÁC HÀM ========

// ---- HÀM KẾT NỐI VÀ GIAO TIẾP ----

// Kết nối WiFi
void connectWiFi() {
  Serial.print("Đang kết nối WiFi đến ");
  Serial.println(WIFI_SSID);
  
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  
  unsigned long startAttemptTime = millis();
  
  while (WiFi.status() != WL_CONNECTED && 
         millis() - startAttemptTime < 10000) {
    Serial.print(".");
    delay(100);
  }
  
