m3xD/auto_parking/esp32/main.cpp
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("\nKhông thể kết nối WiFi. Đang khởi động lại...");
    ESP.restart();
  }
  
  Serial.println("\nĐã kết nối WiFi");
  Serial.print("Địa chỉ IP: ");
  Serial.println(WiFi.localIP());
  
  deviceMacAddress = WiFi.macAddress();
  Serial.print("Địa chỉ MAC: ");
  Serial.println(deviceMacAddress);
  
  // Đồng bộ thời gian sau khi kết nối WiFi
  syncNTPTime();
}

// Đồng bộ thời gian từ server NTP
void syncNTPTime() {
  Serial.println("Đang đồng bộ thời gian với NTP server...");
  configTime(GMT_OFFSET_SEC, DAYLIGHT_OFFSET_SEC, NTP_SERVER);
  
  struct tm timeinfo;
  int retry = 0;
  while (!getLocalTime(&timeinfo) && retry < 5) {
    Serial.println("Đang chờ đồng bộ thời gian...");
    delay(1000);
    retry++;
  }
  
  if (retry >= 5) {
    Serial.println("Không thể đồng bộ thời gian. Tiếp tục...");
    return;
  }
  
  Serial.print("Thời gian hiện tại: ");
  Serial.println(getTimeStamp());
}

// Lấy timestamp hiện tại từ NTP
String getTimeStamp() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo)) {
    return "Unknown";
  }
  char timeStringBuff[50];
  strftime(timeStringBuff, sizeof(timeStringBuff), "%Y-%m-%d %H:%M:%S", &timeinfo);
  return String(timeStringBuff);
}

// Thử kết nối lại AWS IoT
boolean reconnectAWSIoT() {
  Serial.println("Đang thử kết nối lại đến AWS IoT Core...");
  
  if (client.connect(THINGNAME)) {
    Serial.println("Đã kết nối lại thành công đến AWS IoT!");
    reconnectCount = 0;
    
    // Đăng ký các topic cần thiết
    client.subscribe("smart_parking/command/barriers/#");
    
    return true;
  }
  
  return false;
}

// Kết nối đến AWS IoT
void connectAWSIoT() {
  // Cấu hình các thông số cho kết nối an toàn
  net.setCACert(AWS_CERT_CA);
  net.setCertificate(AWS_CERT_CRT);
  net.setPrivateKey(AWS_CERT_PRIVATE);
  
  // Cấu hình client MQTT
  client.setServer(AWS_IOT_ENDPOINT, 8883);
  client.setCallback(messageHandler);
  client.setKeepAlive(60); // Cấu hình keep-alive 60 giây
  
  Serial.println("Đang kết nối đến AWS IoT Core...");
  
  // Cấu hình timeout cho các thao tác mạng
  net.setTimeout(2000); // 2 giây timeout
  
  reconnectCount = 0;
  while (!client.connected() && reconnectCount < MAX_RECONNECT_ATTEMPTS) {
    Serial.print("Lần thử #");
    Serial.print(reconnectCount + 1);
    Serial.print("... ");
    
    if (client.connect(THINGNAME)) {
      Serial.println("Đã kết nối!");
      
      // Đăng ký các topic
      client.subscribe("smart_parking/command/barriers/#");
      
      // Xuất bản trạng thái ban đầu
      publishInitialState();
      
      return;
    }
    
    Serial.println("Thất bại.");
    reconnectCount++;
    delay(RECONNECT_INTERVAL);
  }
  
  if (reconnectCount >= MAX_RECONNECT_ATTEMPTS) {
    Serial.println("Đã vượt quá số lần thử kết nối. Khởi động lại ESP32...");
    ESP.restart();
  }
}

// ---- HÀM XỬ LÝ MQTT ----

// Xử lý thông điệp MQTT nhận được
void messageHandler(char* topic, byte* payload, unsigned int length) {
  Serial.print("Nhận thông điệp từ topic: ");
  Serial.println(topic);
  
  // Chuyển đổi payload thành chuỗi kết thúc null
  char payloadStr[length + 1];
  memcpy(payloadStr, payload, length);
  payloadStr[length] = '\0';
  
  Serial.print("Nội dung: ");
  Serial.println(payloadStr);
  
  // Xử lý thông điệp lệnh điều khiển rào chắn
  if (strstr(topic, "smart_parking/command/barriers/") != NULL) {
    DynamicJsonDocument doc(256);
    DeserializationError error = deserializeJson(doc, payloadStr);
    
    if (error) {
      Serial.print("deserializeJson() thất bại: ");
      Serial.println(error.c_str());
      return;
    }
    
    // Xử lý lệnh điều khiển rào chắn
    if (strstr(topic, "entry") != NULL) {
      const char* action = doc["command"];
      if (strcmp(action, "open") == 0) {
        Serial.println("Lệnh mở rào vào");
        servoEntry.write(0);
        entryGateOpen = true;
        publishBarrierState("entry", "opened");
      } else if (strcmp(action, "close") == 0) {
        Serial.println("Lệnh đóng rào vào");
        servoEntry.write(90);
        entryGateOpen = false;
        publishBarrierState("entry", "closed");
      }
    } else if (strstr(topic, "exit") != NULL) {
      const char* action = doc["command"];
      if (strcmp(action, "open") == 0) {
        Serial.println("Lệnh mở rào ra");
        servoExit.write(0);
        exitGateOpen = true;
        publishBarrierState("exit", "opened");
      } else if (strcmp(action, "close") == 0) {
        Serial.println("Lệnh đóng rào ra");
        servoExit.write(90);
        exitGateOpen = false;
        publishBarrierState("exit", "closed");
      }
    }
    
    // Cập nhật thời gian hoạt động cuối cùng
    lastActivityTime = millis();
    
    // Lưu trạng thái mới
    saveState();
  }
}

// Thêm thông điệp vào hàng đợi MQTT
bool queueMqttMessage(const char* topic, const char* payload, size_t length, int qos, bool retained) {
  if (mqttQueueIndex >= MAX_MQTT_QUEUE) {
    Serial.println("Hàng đợi MQTT đầy, bỏ qua thông điệp");
    return false;
  }
  
  if (length > 0 && length < MAX_MQTT_PAYLOAD_SIZE) {
    strncpy(mqttQueue[mqttQueueIndex].topic, topic, 49);
    strncpy(mqttQueue[mqttQueueIndex].payload, payload, MAX_MQTT_PAYLOAD_SIZE - 1);
    mqttQueue[mqttQueueIndex].length = length;
    mqttQueue[mqttQueueIndex].qos = qos;
    mqttQueue[mqttQueueIndex].retained = retained;
    mqttQueue[mqttQueueIndex].pending = true;
    mqttQueueIndex++;
    Serial.print("Message đã được queue");
    return true;
  }
  
  Serial.println("Kích thước payload không hợp lệ");
  return false;
}

// Xuất bản thông điệp MQTT với hàng đợi
bool publishMqttMessage(const char* topic, const JsonDocument& doc, int qos, bool retained) {
  char buffer[MAX_MQTT_PAYLOAD_SIZE];
  size_t n = serializeJson(doc, buffer);
  
  if (n > 0 && n < MAX_MQTT_PAYLOAD_SIZE) {
    if (client.connected()) {
      return client.publish(topic, (const uint8_t*)buffer, n, retained);
    } else {
      return queueMqttMessage(topic, buffer, n, qos, retained);
    }
  }
  
