m3xD/auto_parking/esp32/main.cpp
  Serial.println("Lỗi serialize JSON");
  return false;
}

// Xử lý các thông điệp trong hàng đợi MQTT
void processQueuedMessages() {
  if (!client.connected() || mqttQueueIndex == 0) {
    return;
  }
  
  int messagesProcessed = 0;
  for (int i = 0; i < mqttQueueIndex; i++) {
    if (mqttQueue[i].pending) {
      bool success = client.publish(
        mqttQueue[i].topic, 
        (const uint8_t*)mqttQueue[i].payload, 
        mqttQueue[i].length, 
        mqttQueue[i].retained
      );
      
      if (success) {
        mqttQueue[i].pending = false;
        messagesProcessed++;
      } else {
        Serial.print("Không thể gửi thông điệp MQTT đến topic: ");
        Serial.println(mqttQueue[i].topic);
        break;
      }
    }
  }
  
  // Nếu đã xử lý tất cả thông điệp, làm trống hàng đợi
  if (messagesProcessed == mqttQueueIndex) {
    mqttQueueIndex = 0;
  }
}

// ---- HÀM XUẤT BẢN TRẠNG THÁI ----

// Xuất bản trạng thái rào chắn
void publishBarrierState(const char* barrierType, const char* state) {
  DynamicJsonDocument doc(256);
  
  // Thêm metadata tiêu chuẩn
  doc["device_id"] = THINGNAME;
  doc["message_type"] = "barrier_state";
  
  // Dữ liệu chính - flat format để dễ truy vấn
  doc["barrier_type"] = barrierType;
  doc["barrier_state"] = state;
  doc["barrier_id"] = String(THINGNAME) + "_" + String(barrierType);
  
  char topic[50];
  snprintf(topic, sizeof(topic), "smart_parking/barriers/%s/state", barrierType);
  
  publishMqttMessage(topic, doc);
}

// Xuất bản sự kiện cảm biến cổng
void publishGateSensorEvent(const char* sensorPinIdentifier, const char* gateArea, const char* eventType) {
  DynamicJsonDocument doc(256);
  
  // Thêm metadata tiêu chuẩn
  doc["device_id"] = THINGNAME;
  doc["message_type"] = "gate_event";
  
  // Dữ liệu sự kiện - flat format
  doc["sensor_id"] = sensorPinIdentifier;
  doc["gate_area"] = gateArea;
  doc["event_type"] = eventType;
  
  char topic[50];
  snprintf(topic, sizeof(topic), "smart_parking/gates/%s/events", gateArea);
  
  publishMqttMessage(topic, doc);
}

// Xuất bản trạng thái chỗ đỗ
void publishParkingSlotStatus(const char* slotMqttId, bool isOccupied) {
  DynamicJsonDocument doc(256);
  doc["device_id"] = THINGNAME;
  doc["slot_id"] = slotMqttId;
  doc["occupied"] = isOccupied;
  doc["timestamp"] = getTimeStamp();
  doc["message_type"] = "slot_status";
  
  char topic[50];
  snprintf(topic, sizeof(topic), "smart_parking/slots/%s/status", slotMqttId);
  
  publishMqttMessage(topic, doc);
}

// Xuất bản trạng thái ban đầu
void publishInitialState() {
  // Xuất bản trạng thái rào chắn
  publishBarrierState("entry", entryGateOpen ? "opened" : "closed");
  publishBarrierState("exit", exitGateOpen ? "opened" : "closed");
  
  // Xuất bản trạng thái chỗ đỗ
  for (int i = 0; i < NUM_PARKING_SLOTS; i++) {
    publishParkingSlotStatus(parkingSlots[i].slotMqttId, parkingSlots[i].isOccupied);
  }
  
  // Xuất bản thông tin thiết bị
  DynamicJsonDocument deviceDoc(256);
  deviceDoc["message_type"] = "startup";
  deviceDoc["device_id"] = THINGNAME;
  deviceDoc["wifi"]["mac"] = deviceMacAddress;
  deviceDoc["wifi"]["ip"] = WiFi.localIP().toString();
  deviceDoc["wifi"]["rssi"] = WiFi.RSSI();
  deviceDoc["firmware_version"] = firmwareVersion;
  
  publishMqttMessage("smart_parking/device/info", deviceDoc);
}

// Báo cáo trạng thái hệ thống
void reportSystemStatus() {
  if (client.connected()) {
    DynamicJsonDocument statusDoc(512);
    
    statusDoc["timestamp"] = getTimeStamp();
    statusDoc["device_id"] = THINGNAME;
    statusDoc["device_type"] = "parking_controller";
    statusDoc["message_type"] = "system_status";
    
    // Device info - flat format
    statusDoc["firmware_version"] = firmwareVersion;
    
    // Connection info
    statusDoc["wifi"]["ssid"] = WiFi.SSID();
    statusDoc["wifi"]["rssi"] = WiFi.RSSI();
    statusDoc["wifi"]["ip"] = WiFi.localIP().toString();
    statusDoc["wifi"]["mac"] = deviceMacAddress;
    
    
    publishMqttMessage("smart_parking/system/status", statusDoc);
  }
}

// ---- HÀM XỬ LÝ CẢM BIẾN ----

// Xử lý cảm biến cổng
void handleGateSensors() {
  unsigned long currentTime = millis();
  bool activityDetected = false;
  
  for (int i = 0; i < NUM_GATE_SENSORS; i++) {
    bool currentPinState = digitalRead(gateSensors[i].pin);
    bool currentlyDetectedActive = (currentPinState == gateSensors[i].activeLogicLevel);

    // Phát hiện thay đổi trạng thái với debounce
    if (currentlyDetectedActive != gateSensors[i].isActive && 
        (currentTime - gateSensors[i].lastDebounceTime > GATE_SENSOR_DEBOUNCE_INTERVAL)) {
      
      gateSensors[i].isActive = currentlyDetectedActive;
      gateSensors[i].lastDebounceTime = currentTime;
      
      // Nếu phát hiện hoạt động, cập nhật thời gian hoạt động cuối
      if (gateSensors[i].isActive) {
        activityDetected = true;
        lastActivityTime = currentTime;
        
        // Xuất bản sự kiện cảm biến
        publishGateSensorEvent(gateSensors[i].sensorIdentifier, 
                              gateSensors[i].gateAreaMqttId, 
                              gateSensors[i].eventTypeOnActive);
        
        // Xử lý rào chắn tự động nếu cần
        if (gateSensors[i].autoCloseBarrier && gateSensors[i].associatedServo != NULL) {
          Serial.print("Cảm biến "); Serial.print(gateSensors[i].sensorIdentifier);
          Serial.println(" kích hoạt: Tự động đóng rào liên quan.");
          
          gateSensors[i].associatedServo->write(gateSensors[i].servoClosePosition);
          
          // Cập nhật trạng thái rào chắn
          if (strcmp(gateSensors[i].barrierTypeForState, "entry") == 0) {
            entryGateOpen = false;
          } else if (strcmp(gateSensors[i].barrierTypeForState, "exit") == 0) {
            exitGateOpen = false;
          }
          
          publishBarrierState(gateSensors[i].barrierTypeForState, "closed_auto");
          
          // Lưu trạng thái mới
          saveState();
        }
      }
      
      gateSensors[i].prevIsActive = gateSensors[i].isActive;
    }
  }
  
  // Nếu phát hiện hoạt động và đang ở chế độ tiết kiệm năng lượng, thoát chế độ đó
  if (activityDetected && lowPowerMode) {
    Serial.println("Hoạt động phát hiện: Trở lại chế độ năng lượng bình thường");
    lowPowerMode = false;
  }
}

// Xử lý cảm biến chỗ đỗ
void handleParkingSlotSensors() {
 unsigned long currentTime = millis();
 bool slotStateChanged = false;
 
 for (int i = 0; i < NUM_PARKING_SLOTS; i++) {
   bool currentPinState = digitalRead(parkingSlots[i].pin);
   bool currentlyDetectedOccupied = (currentPinState == parkingSlots[i].activeLogicLevel);

