m3xD/auto_parking/esp32/main.cpp
   // Phát hiện thay đổi trạng thái với debounce
   if (currentlyDetectedOccupied != parkingSlots[i].isOccupied && 
       (currentTime - parkingSlots[i].lastDebounceTime > SLOT_DEBOUNCE_DELAY)) {
     
     parkingSlots[i].isOccupied = currentlyDetectedOccupied;
     parkingSlots[i].lastDebounceTime = currentTime;
     
     // Xuất bản trạng thái mới
     publishParkingSlotStatus(parkingSlots[i].slotMqttId, parkingSlots[i].isOccupied);
     parkingSlots[i].prevIsOccupied = parkingSlots[i].isOccupied;
     
     slotStateChanged = true;
     lastActivityTime = currentTime; // Cập nhật thời gian hoạt động cuối
   }
 }
 
 // Nếu có thay đổi trạng thái, lưu trạng thái mới
 if (slotStateChanged) {
   saveState();
 }
}

// ---- HÀM LƯU TRỮ TRẠNG THÁI ----

// Lưu trạng thái vào bộ nhớ không bay hơi
void saveState() {
 // Lưu trạng thái của các chỗ đỗ
 for (int i = 0; i < NUM_PARKING_SLOTS; i++) {
   String key = "slot" + String(i);
   preferences.putBool(key.c_str(), parkingSlots[i].isOccupied);
 }
 
 // Lưu trạng thái rào chắn
 preferences.putBool("entry_open", entryGateOpen);
 preferences.putBool("exit_open", exitGateOpen);
 
 // Lưu thông tin chế độ năng lượng
 preferences.putBool("low_power", lowPowerMode);
 
 // Lưu thời gian
 preferences.putULong("lastSave", millis());
 
 Serial.println("Đã lưu trạng thái hệ thống vào bộ nhớ local");
}

// Khôi phục trạng thái từ bộ nhớ không bay hơi
void restoreState() {
 // Kiểm tra xem có trạng thái đã lưu không
 unsigned long lastSave = preferences.getULong("lastSave", 0);
 if (lastSave > 0) {
   Serial.println("Đang khôi phục trạng thái trước đó...");
   
   // Khôi phục trạng thái chỗ đỗ
   totalOccupiedSlots = 0;
   for (int i = 0; i < NUM_PARKING_SLOTS; i++) {
     String key = "slot" + String(i);
     parkingSlots[i].isOccupied = preferences.getBool(key.c_str(), false);
     parkingSlots[i].prevIsOccupied = parkingSlots[i].isOccupied;
     
     if (parkingSlots[i].isOccupied) {
       totalOccupiedSlots++;
     }
   }
   
   // Khôi phục trạng thái rào chắn
   entryGateOpen = preferences.getBool("entry_open", false);
   exitGateOpen = preferences.getBool("exit_open", false);
   
   // Khôi phục thông tin chế độ năng lượng
   lowPowerMode = preferences.getBool("low_power", false);
   
   Serial.println("Đã khôi phục trạng thái hệ thống từ bộ nhớ local");
 } else {
   Serial.println("Không tìm thấy trạng thái đã lưu trước đó");
 }
}

void setupWatchdog() {
  #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    // Cho ESP-IDF 5.x trở lên
    esp_task_wdt_config_t wdt_config = {
      .timeout_ms = WDT_TIMEOUT * 1000,
      .idle_core_mask = 0,
      .trigger_panic = true
    };
    esp_task_wdt_init(&wdt_config);
  #else
    // Cho ESP-IDF phiên bản cũ
    esp_task_wdt_init(WDT_TIMEOUT, true);
  #endif
  esp_task_wdt_add(NULL);
}


// ======= CÁC HÀM CHÍNH ========

// Hàm setup
void setup() {
 // Khởi tạo giao tiếp Serial
 Serial.begin(115200);
 while (!Serial && millis() < 5000); // Đợi tối đa 5 giây cho serial, rồi tiếp tục
 delay(1000);

 // Lưu thời gian khởi động
 systemStartTime = millis();

 Serial.println("\n\n--- ĐÃ KHỞI ĐỘNG HỆ THỐNG QUẢN LÝ BÃI ĐỖ XE ---");
 Serial.print("Phiên bản firmware: ");
 Serial.println(firmwareVersion);
 Serial.println("Ngày: " + getTimeStamp());

 // Khởi tạo watchdog
  // Serial.println("Đang khởi tạo Watchdog Timer...");
  // setupWatchdog();
 
 // Khởi tạo Preferences cho lưu trữ
 preferences.begin("parking", false);
 Serial.println("Đã khởi tạo bộ nhớ không bay hơi");
 
 // Khôi phục trạng thái trước đó nếu có
 restoreState();

 Serial.println("Đang khởi tạo cảm biến và rào chắn...");
 
 // Khởi tạo pin cho cảm biến cổng
 for (int i = 0; i < NUM_GATE_SENSORS; i++) {
   pinMode(gateSensors[i].pin, INPUT);
   bool initialPinState = digitalRead(gateSensors[i].pin);
   gateSensors[i].isActive = (initialPinState == gateSensors[i].activeLogicLevel);
   gateSensors[i].prevIsActive = gateSensors[i].isActive;
   
   Serial.print("Cảm biến ");
   Serial.print(gateSensors[i].sensorIdentifier);
   Serial.print(": trạng thái ban đầu = ");
   Serial.println(gateSensors[i].isActive ? "ACTIVE" : "INACTIVE");
 }

 // Khởi tạo pin cho cảm biến chỗ đỗ
 for (int i = 0; i < NUM_PARKING_SLOTS; i++) {
   pinMode(parkingSlots[i].pin, INPUT);
   bool initialPinState = digitalRead(parkingSlots[i].pin);
   parkingSlots[i].isOccupied = (initialPinState == parkingSlots[i].activeLogicLevel);
   parkingSlots[i].prevIsOccupied = parkingSlots[i].isOccupied;
   
   Serial.print("Chỗ đỗ ");
   Serial.print(parkingSlots[i].slotMqttId);
   Serial.print(": trạng thái ban đầu = ");
   Serial.println(parkingSlots[i].isOccupied ? "OCCUPIED" : "AVAILABLE");
 }

 // Gắn và đặt vị trí ban đầu cho servo
 servoEntry.attach(SERVO_ENTRY_PIN);
 servoExit.attach(SERVO_EXIT_PIN);
 
 // Đặt vị trí servo dựa trên trạng thái đã khôi phục
 if (entryGateOpen) {
   servoEntry.write(90);
 } else {
   servoEntry.write(0);
 }
 
 if (exitGateOpen) {
   servoExit.write(0);
 } else {
   servoExit.write(90);
 }
 
 Serial.print("Rào vào: ");
 Serial.println(entryGateOpen ? "MỞ" : "ĐÓNG");
 Serial.print("Rào ra: ");
 Serial.println(exitGateOpen ? "MỞ" : "ĐÓNG");

 // Khởi tạo biến hoạt động
 lastActivityTime = millis();
 
 // Kết nối WiFi và AWS IoT
 connectWiFi();
 connectAWSIoT();
 
 Serial.println("--- Khởi động hoàn tất ---");
}

// Hàm loop
void loop() {
 unsigned long currentTime = millis();
 
 // Đặt lại watchdog
 // esp_task_wdt_reset();
 
 // Kiểm tra kết nối WiFi và MQTT
 if (WiFi.status() != WL_CONNECTED) {
   Serial.println("WiFi bị ngắt kết nối. Đang kết nối lại...");
   connectWiFi();
 }
 
 if (!client.connected()) {
   // Thử kết nối lại nếu đã đến lúc
   if (currentTime - lastReconnectAttempt > RECONNECT_INTERVAL) {
     lastReconnectAttempt = currentTime;
     if (reconnectAWSIoT()) {
       Serial.println("Đã kết nối lại thành công đến AWS IoT!");
       lastReconnectAttempt = 0;
     } else {
       reconnectCount++;
       if (reconnectCount > MAX_RECONNECT_ATTEMPTS) {
         Serial.println("Quá nhiều lần thử kết nối thất bại. Đang khởi động lại...");
         ESP.restart();
       }
     }
   }
 } else {
   client.loop();
   processQueuedMessages(); // Xử lý các thông điệp trong hàng đợi
   reconnectCount = 0; // Đặt lại bộ đếm khi kết nối thành công
 }
 
 // Quản lý chế độ năng lượng dựa trên hoạt động
 if (!lowPowerMode && (currentTime - lastActivityTime > ACTIVITY_TIMEOUT)) {
   Serial.println("Không có hoạt động trong thời gian dài: Chuyển sang chế độ tiết kiệm năng lượng");
   lowPowerMode = true;
   saveState(); // Lưu trạng thái chế độ năng lượng
 }
 
 // Xử lý cảm biến 
 handleGateSensors();
 handleParkingSlotSensors();
 
 // Nếu ở chế độ tiết kiệm năng lượng, giảm tần số quét cảm biến
 if (lowPowerMode) {
   delay(500); // Thêm độ trễ để giảm tần số quét
 }
 
 // Báo cáo trạng thái định kỳ
 if (currentTime - lastStatusReport > STATUS_REPORT_INTERVAL) {
   lastStatusReport = currentTime;
   reportSystemStatus();
 }
 
 // Đồng bộ thời gian NTP định kỳ (mỗi 24 giờ)
 static unsigned long lastNTPSync = 0;
 if (currentTime - lastNTPSync > 86400000) { // 24 giờ
   lastNTPSync = currentTime;
   syncNTPTime();
 }
 
 // Lưu trạng thái định kỳ
 if (currentTime - lastStateSave > STATE_SAVE_INTERVAL) {
   lastStateSave = currentTime;
   saveState();
 }
}
